#!/usr/bin/python
# -*- coding: UTF-8 -*-
# 可以在这里添加新的阴阳怪气, {}为昵称位置

# 单排的阴阳怪气
WIN_NEGATIVE_SOLO = [
    '{}侥幸赢得了比赛',
    '{}走狗屎运赢得了比赛',
    '{}躺赢了比赛',
]

WIN_POSTIVE_SOLO = [
    '{}带领团队走向了胜利',
    '{}暴打对面后赢得了胜利',
    '{} CARRY全场赢得了胜利',
    '{}把对面当猪宰了, 赢得了胜利.',
    '{}又赢了, 这游戏就是这么枯燥, 且乏味.',
]

LOSE_NEGATIVE_SOLO = [
    '{}被人按在地上摩擦, 输掉了这场比赛',
    '{}悲惨地输掉了比赛',
    '{}头都被打歪了, 心态爆炸地输掉了比赛.',
    '{}捕鱼被鱼吃了, 输掉了比赛.',
    '{}打的是个几把.'
]

LOSE_POSTIVE_SOLO = [
    '{}无力回天输掉了比赛.',
    '{}尽力了, 但还是输了比赛.',
    '{}Carry全场, 虽败犹荣.',
    '{}带不动队友, 输了比赛',
    '{}又输了, 很难受, 宁愿输的是我.',
]

# 组排的阴阳怪气
WIN_NEGATIVE_PARTY = [
    '{}侥幸赢得了比赛',
    '{}走狗屎运赢得了比赛',
    '{}躺赢了比赛',
    '{}打团都没来, 队友4V5赢得了比赛.'
]

WIN_POSTIVE_PARTY = [
    '{}带领团队走向了胜利',
    '{}暴打对面后赢得了胜利',
    '{} CARRY全场赢得了胜利',
    '{}把对面当猪宰了, 赢得了胜利.',
    '{}又赢了, 这游戏就是这么枯燥, 且乏味.',
]

LOSE_NEGATIVE_PARTY = [
    '{}被人按在地上摩擦, 输掉了这场比赛',
    '{}悲惨地输掉了比赛',
    '{}头都被打歪了, 心态爆炸地输掉了比赛.',
    '{}捕鱼被鱼吃了, 输掉了比赛.',
    '{}打的是个几把.'
]

LOSE_POSTIVE_PARTY = [
    '{}无力回天输掉了比赛.',
    '{}尽力了, 但还是输了比赛.',
    '{}背靠世界树, 虽败犹荣.',
    '{}带不动队友, 输了比赛',
    '{}又输了, 很难受, 宁愿输的是我.',
]